* Randomhack
** DONE Bugs
*** DONE Enemy array isn't cleared when generating a new level
*** DONE There should only be 8 item slots (and 9 console lines)
*** DONE Enemies shouldn't start on top of player or goal
    Fixed by filtering out positions that are close to player or
    goal.
*** DONE Message when trying to scoop up torch with bottle (and other stuff)
*** DONE Message when nothing to scoop up with bottle
*** DONE Make sure hp doesn't exceed maxhp
    :CLOCK:
    CLOCK: [2011-11-02 Wed 23:13]--[2011-11-02 Wed 23:18] =>  0:05
    CLOCK: [2011-11-02 Wed 07:28]--[2011-11-02 Wed 07:31] =>  0:03
    :END:
*** DONE Remove sweet berries from inventory when used
    CLOCK: [2011-11-02 Wed 07:31]--[2011-11-02 Wed 07:38] =>  0:07
** TODO Refactorings
*** DONE Push up moveRelative from Player and Enemy to GameObject
*** DONE Push up checking for obstacles when moving to GameObject
*** DONE Create class CreatureController, move methods from Level to it
*** DONE Add getters and setters for Point x and y
*** DONE Field.getTile should take a Point instead of x and y
*** DONE Field.setTile should take a Point instead of x and y
*** DONE Convert the enums to stronger typed ones
**** DONE Add Enum.as to project 
     See http://scottbilas.com/blog/ultimate-as3-fake-enums/ for code.
**** DONE Convert SpriteType to new enum style
**** DONE Convert TileType to new enum style
**** DONE Convert PoisonType to new enum style
**** DONE Convert KeyType to new enum style
**** DONE Convert LevelType to new enum style
*** DONE Player and Enemy should have superclass Creature
    :CLOCK:
    CLOCK: [2011-10-31 Mon 07:19]--[2011-10-31 Mon 07:41] =>  0:22
    CLOCK: [2011-10-28 Fri 16:56]--[2011-10-28 Fri 17:18] =>  0:22
    CLOCK: [2011-10-28 Fri 08:21]--[2011-10-28 Fri 08:44] =>  0:23
    CLOCK: [2011-10-27 Thu 07:23]--[2011-10-27 Thu 07:47] =>  0:24
    CLOCK: [2011-10-26 Wed 18:19]--[2011-10-26 Wed 18:23] =>  0:04
    CLOCK: [2011-10-26 Wed 18:08]--[2011-10-26 Wed 18:17] =>  0:09
    :END:
*** DONE Bottle::useItem is long and ugly, make it nicer
    CLOCK: [2011-11-10 Thu 07:23]--[2011-11-10 Thu 07:29] =>  0:06
*** TODO Player should keep track of that action is performed
*** TODO Move up similarities in tests to superclass
*** TODO Use Point.getPointsAround where applicable
** DONE Point
*** DONE Add getPointsAround method
    Should return Array of 8 Point objects.
** DONE Input
*** DONE Interface for reading keys
*** DONE Flixel implementation of reading keys
    Only direction keys so far.
** DONE Help
   CLOCK: [2011-11-17 Thu 07:26]--[2011-11-17 Thu 07:43] =>  0:17
   Press <key> for help.
** TODO Game Over
*** DONE Show bones instead of player sprite
    :CLOCK:
    CLOCK: [2011-11-20 Sun 21:04]--[2011-11-20 Sun 21:06] =>  0:02
    CLOCK: [2011-11-17 Thu 18:08]--[2011-11-17 Thu 18:22] =>  0:14
    :END:
*** DONE Lock input (don't walk around as dead...)
    CLOCK: [2011-11-21 Mon 07:23]--[2011-11-21 Mon 07:30] =>  0:07
*** DONE Press <key> (enter?) to restart
** TODO Level
*** TODO Listen for "start button" (whatever that is)
    Perhaps a "click to restart" instead.
*** DONE Check if player is dead
*** DONE Print out starting message
    Will do this as part of a startGame method.
*** DONE Keep track of items in level
*** TODO Some kind of LevelBuilder/LevelGenerator
** TODO Field
*** DONE Get a randomized list of empty tile positions
*** TODO Better distance between player start and goal
*** DONE Tile rendering
    Should randomly make jagged edges in cave levels.
*** DONE Ruins
**** DONE Generate ruins
     :CLOCK:
     CLOCK: [2011-11-16 Wed 19:40]--[2011-11-16 Wed 20:04] =>  0:24
     CLOCK: [2011-11-16 Wed 08:22]--[2011-11-16 Wed 08:43] =>  0:21
     CLOCK: [2011-11-15 Tue 18:16]--[2011-11-15 Tue 18:23] =>  0:07
     CLOCK: [2011-11-15 Tue 18:09]--[2011-11-15 Tue 18:13] =>  0:04
     CLOCK: [2011-11-15 Tue 18:04]--[2011-11-15 Tue 18:09] =>  0:05
     CLOCK: [2011-11-15 Tue 08:23]--[2011-11-15 Tue 08:44] =>  0:21
     :END:
**** DONE Draw ruins
** TODO Player
*** DONE Generate gender and attractive gender
*** DONE Generate name and prefix
*** DONE Generate playerpower
*** DONE Movement
    Shouldn't walk right over enemies.
*** DONE HP / max HP
*** DONE Attacking
*** DONE Print to the console when attacking
*** TODO Talking
*** DONE Inventory
*** DONE Picking up stuff
*** DONE Dropping stuff
*** DONE Selecting stuff
*** DONE Using stuff
*** DONE Poison
*** DONE Should have a reference to DisplayableStatus, and update it
*** DONE Equip weapon when picked up
    CLOCK: [2011-11-10 Thu 07:31]--[2011-11-10 Thu 07:44] =>  0:13
** TODO Items
*** DONE Item supertype
*** TODO ItemController
**** TODO Check if position is taken when adding item
*** DONE Item factory
    :CLOCK:
    CLOCK: [2011-11-05 Sat 20:25]--[2011-11-05 Sat 20:32] =>  0:07
    CLOCK: [2011-11-05 Sat 15:31]--[2011-11-05 Sat 15:37] =>  0:06
    CLOCK: [2011-11-03 Thu 18:05]--[2011-11-03 Thu 18:21] =>  0:16
    CLOCK: [2011-11-03 Thu 08:23]--[2011-11-03 Thu 08:44] =>  0:21
    :END:
*** DONE Weapons
**** DONE Bare hands
**** DONE Sword(s)
     Kind of special. Can only carry one sword. No other kinds of
     weapons are available (except bare hands).
*** DONE Stick
*** DONE Torch
    Should light sticks all around the player (including stick that
    the player is standing on).
**** TODO Should call attackedWithFire on Enemy when used
*** DONE Rubble
    Done for now. Later on, rubble can be used to crush berries to
    make jam. But first we need some berries!
*** DONE Bottle
*** TODO SWEETBOTTLE
*** TODO BITTERBOTTLE
*** DONE WATERBOTTLE
    :CLOCK:
    CLOCK: [2011-11-09 Wed 07:22]--[2011-11-09 Wed 07:41] =>  0:19
    CLOCK: [2011-11-08 Tue 07:29]--[2011-11-08 Tue 07:43] =>  0:14
    CLOCK: [2011-11-07 Mon 18:06]--[2011-11-07 Mon 18:25] =>  0:19
    CLOCK: [2011-11-07 Mon 08:22]--[2011-11-07 Mon 08:30] =>  0:08
    :END:
    Pick up water if bottle used next to water tile.
*** DONE BLOODBOTTLE
*** TODO DUSTBOTTLE
*** TODO SWEETBERRYBOTTLE
*** TODO BITTERBERRYBOTTLE
*** DONE GOLD
    :CLOCK:
    CLOCK: [2011-10-31 Mon 18:44]--[2011-10-31 Mon 18:56] =>  0:12
    CLOCK: [2011-10-31 Mon 08:49]--[2011-10-31 Mon 08:52] =>  0:03
    CLOCK: [2011-10-31 Mon 08:27]--[2011-10-31 Mon 08:49] =>  0:22
    :END:
    Partially done. Should pick up when walked over.
*** DONE SWEETBERRIES
    :CLOCK:
    CLOCK: [2011-11-02 Wed 07:19]--[2011-11-02 Wed 07:25] =>  0:06
    CLOCK: [2011-11-01 Tue 17:56]--[2011-11-01 Tue 18:24] =>  0:28
    :END:
*** DONE BLOOD
*** TODO DUST
*** TODO SWEETJAM
*** TODO WATERPOOL
*** DONE BITTERBERRIES
    CLOCK: [2011-11-02 Wed 23:36]--[2011-11-02 Wed 23:55] =>  0:19
*** TODO BITTERJAM
*** TODO PICK
*** TODO AMULET
*** TODO SCROLL
*** TODO BONES
*** TODO GOALITEM
*** TODO STOREITEM
*** TODO KEY
*** TODO CHEST
*** TODO HID
*** TODO BLACKCARD
*** TODO ANKH
*** TODO BLACKARMOR
*** TODO BIGGOLD
*** TODO BLUEFLY
*** TODO IDENTIFIER
*** TODO FLAME
*** TODO EMBERS
** TODO General enemy stuff
*** DONE Enemy name
*** TODO Enemy prefix (and additional modifications)
*** DONE Keep track of hp and max hp
*** DONE Movement
    Right now an enemy moves every time that it is its turn, but
    originally it only moves if it's lucky (d10 <= speed).
*** TODO Should get list of available spots and select one randomly when moving
*** DONE Attacking
**** DONE Add accuracy
**** DONE Add power
*** DONE Print to the console when attacking
*** TODO Line of sight
** TODO Enemies
*** DONE Array of enemies in Level
*** DONE Enemy factory
    CLOCK: [2011-11-01 Tue 07:19]--[2011-11-01 Tue 07:34] =>  0:15
*** DONE Bat
*** DONE Flea
*** DONE Snake
*** DONE Goblin
*** DONE Mingbat
    Mingbat shouldn't pick up blood.
*** DONE Undead
    Poison, fear, and weak to fire. Need to implement fear and weak to
    fire.
**** DONE Fear
***** DONE Add FearType with NO_FEAR, FEAR, TERROR, and INSANITY.
***** DONE Add getter for causesFear to Enemy
***** DONE Add getter for fearType to Enemy
***** DONE Check for insanity before moving player.
**** DONE Weak to fire
***** DONE Add attackedWithFire to Enemy
***** DONE Call enemy.attackedWithFire when swinging torch
**** DONE Undead enemy
***** DONE Correct stats for Undead
***** DONE Class
***** DONE Override getter for causesFear
***** DONE Override getter for fearType
***** DONE Inflicts poison
***** DONE Override attackedWithFire
*** DONE Mimic
    :CLOCK:
    CLOCK: [2011-11-09 Wed 20:49]--[2011-11-09 Wed 20:55] =>  0:06
    CLOCK: [2011-11-09 Wed 20:34]--[2011-11-09 Wed 20:48] =>  0:14
    CLOCK: [2011-11-09 Wed 17:56]--[2011-11-09 Wed 18:16] =>  0:20
    :END:
*** TODO Watershade
*** TODO Slime
*** TODO Stoneworm
*** TODO Flicker
*** TODO Thirster
*** TODO Troll
*** TODO Unseen
*** TODO Clutterfly
*** TODO Mage
*** TODO VenusPlant
*** TODO WhirlImp
*** TODO ArachnoRex
*** TODO WallMaster
*** TODO Succubus
*** TODO FireWraith
*** TODO Wizard
*** TODO Dragon
*** TODO Titan
*** TODO Morpher
*** TODO AbyssWorm
*** TODO Baelrog
*** TODO ZombieDrgn
*** TODO DarkYoung
*** TODO Zentraidon
** TODO Info screen
   In the original, all info and items where displayed as text in a
   console view. This should be made more general so that how the
   information is displayed can be changed at a later point. I'll
   implement a console anyway to display the stuff, to make this
   reimplementation look just like the "old school" original.
*** DONE Keep track of status
    Some kind of object that keeps track of status that should be
    displayed. HP/maxHP, inventory, power, gold, level, hiscore,
    poison, burn, weapon, player prefix and name, console strings.
*** TODO Keep track of and display poison and burn
*** DONE Keep track of and display inventory
*** DONE Display selected item slot
*** DONE InfoView interface
    Interface for views that display information in a ScoreKeeper
    object.
*** DONE ConsoleInfoView
    And InfoView that displays the info as text in a console. Done for
    now means that it's started.
*** DONE Flesh out ConsoleInfoView to look like original
*** DONE Add scrolling to Console and ConsoleInfoView
*** DONE Console
**** DONE Simple font engine
     Use sprite graphics factory to provide characters.
